/***************************************************************************
         嵌入式系统通用驱动程序接口及其实现4-Flash读写标准化接口

此接口为具体项目的Flash读写提供统一接口, 以实现Flash硬件与应用的分离。
****************************************************************************/
#ifndef __FLASH_H
#define __FLASH_H

/***************************************************************************
                        相关配置
****************************************************************************/

//有在擦除期间要执行的代码，在放在RAM中执行时需定义
//此功能用以防止擦除时间过长(有的几秒)，导致影响必要的工作的问题(如：数码管扫描)
//定义后，需实现Flash_cbEraseInRam()
//功能依赖于硬件功能,且部分驱动程序支持

//#define SUPPORT_FLASH_ERASE_IN_RAM 

/***************************************************************************
                        相关标准常量定义
****************************************************************************/

extern unsigned long Flash_ErrCount; //失败计数器

/***************************************************************************
                        相关标准函数定义
****************************************************************************/

//------------------------初始化函数------------------------------
void Flash_Init(void);

//---------------------------Flash解锁---------------------------------
void Flash_Unlock(void);

//---------------------------Flash加锁---------------------------------
void Flash_Lock(void);

//---------------------------------Flash页擦除--------------------------
//此函数仅负责页擦除，不负责加解锁等
void Flash_ErasePage(unsigned long Adr);

//-------------------------------写数据到Flash中实现--------------------
//此函数仅负责向Flash写数据，不负责加解锁及擦除
void Flash_Write(unsigned long Adr,   //Flash地址
                 const void *pVoid,  //要写入的数据
                 unsigned long Len);   //写数据长度

//----------------------------从Flash中读取数据实现------------------------
//此函数为可选功能,可不实现
void Flash_Read(unsigned long Adr,   //Flash地址
                void *pVoid,        //要读出的数据
                unsigned long Len);  //读数据长度

/***************************************************************************
                          回调函数定义
****************************************************************************/

//----------------------------------擦除前通报-----------------------------
//此功能用于FLASH操作中可能长时间等待时，系统作相应处理,
void Flash_cbErasePageStartNotify(void);
//不需要此功能时实现为空：
//#define Flash_cbErasePageStartNotify() do{}while(0)  

//-----------------------写单位数据间隔期间通报---------------------------
//写一组数据期间将调用此函数防止
void Flash_cbWrIdieNotify(void);

//----------------------在擦除期间要执行的代码-----------------------------
#ifdef SUPPORT_FLASH_ERASE_IN_RAM 
  //在其内部区分出RAM上执行的函数, 见Flash_cbEraseInRam.c中的伪代码
  void Flash_cbEraseInRam(void);
#endif

#endif



