/***************************************************************************
         嵌入式系统通用驱动程序接口及其实现4-Flash读写标准化接口

此接口为具体项目的Flash读写提供统一接口, 以实现Flash硬件与应用的分离。
****************************************************************************/
#ifndef __FLASH_H
#define __FLASH_H

/***************************************************************************
                        相关标准常量定义
****************************************************************************/

extern unsigned long Flash_ErrCount; //失败计数器

/***************************************************************************
                        相关标准函数定义
****************************************************************************/

//------------------------初始化函数------------------------------
void Flash_Init(void);

//---------------------------Flash解锁---------------------------------
void Flash_Unlock(void);

//---------------------------Flash加锁---------------------------------
void Flash_Lock(void);

//---------------------------------Flash页擦除--------------------------
//此函数仅负责页擦除，不负责加解锁等
void Flash_ErasePage(unsigned long Adr);

//-------------------------------写数据到Flash中实现--------------------
//此函数仅负责向Flash写数据，不负责加解锁及擦除
void Flash_Write(unsigned long Adr,   //Flash地址
                 const void *pVoid,  //要写入的数据
                 unsigned long Len);   //写数据长度

//----------------------------从Flash中读取数据实现------------------------
//此函数为可选功能,可不实现
void Flash_Read(unsigned long Adr,   //Flash地址
                void *pVoid,        //要读出的数据
                unsigned long Len);  //读数据长度

/***************************************************************************
                          回调函数定义
****************************************************************************/

//----------------------------------擦除前通报-----------------------------
//此功能用于FLASH操作中可能长时间等待时，系统作相应处理,
void Flash_cbErasePageStartNotify(void);
//不需要此功能时实现为空：
//#define Flash_cbErasePageStartNotify() do{}while(0)  

//-----------------------写单位数据间隔期间通报---------------------------
//写一组数据期间将调用此函数防止
void Flash_cbWrIdieNotify(void);

#endif



